<a href="https://colab.research.google.com/github/rushikesh-aware/machine-learn/blob/master/pandasstatexamples1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# Import the necessary libraries
import pandas as pd

In [5]:
#load dataset from csv file
from google.colab import files
uploaded = files.upload()
df = pd.read_csv("baby_names.csv")
df

Saving baby_names.csv to baby_names.csv

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [6]:
#See the first 10 entries
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [7]:
#display all columns from dataframe
df.columns

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [15]:
#Delete the column 'Unnamed: 0' and 'Id'
 
df.drop(["Unnamed: 0","Id"],axis=1)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [10]:
#Is there more male or female names in the dataset?
a=df[df.Gender=="M"].shape[0]
b=df[df.Gender=="F"].shape[0]
if(a<b):
    print("Female names are more")
else:
    print("Male names are more")

Female names are more

In [11]:
#display the count of each name present in dataset
df["Name"].value_counts().sort_index()

Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Name, Length: 17632, dtype: int64

In [16]:
#What is the name with most occurrences?
grouped_name=df.groupby(["Name"])
c=(grouped_name.Count.sum().sort_values(ascending=False))
c[0:1]

Name
Jacob    242874
Name: Count, dtype: int64

In [18]:
#Get a summary with the mean, min, max, std 
grouped_name.Count.sum().describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64